'use strict'

function makeUser() {
    return {
      name: "John",
      ref: this
    };
}
  
let user = makeUser();

console.log( user.ref.name ); // Каким будет результат?
// Ответ: ошибка
// Переменной user присваивается результат выполнения функции,
// в этом случае это обьект.
// При обращении к обьекту user по ключу ref с использованием 'use strict'
// в браузере мы получаем значение undefined.
// Без использования мы получим глобальный обьект window.
// При обращении к this по клучу name c использованием 'use strict' мы получим ошибку,
// а без использования мы получим пустую строку(в обьекте window есть ключ name
// со значением пустой строки)
// Если запустить скрипт на node.js мы получим undefined,
// потому что на node.js this в данном случае является
// глобальным обьектом без поля name.